{
  "barangay_hall_investigation": {
	"dialogue_lines": [
	  {
		"speaker": "Miguel",
		"text": "Celine, dito tayo sa barangay hall. Kailangan nating makausap si Kapitana Lourdes."
	  },
	  {
		"speaker": "Celine",
		"text": "Oo, para malaman natin kung ano ang nangyari kay Leo. Sana maging cooperative siya."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Good morning! Welcome sa barangay hall. May kailangan ba kayo?"
	  },
	  {
		"speaker": "Miguel",
		"text": "Good morning po, Kapitana. Kami po si Miguel at Celine. May mga tanong po kami tungkol kay Leo, yung pulis na namatay."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Ah, kayo pala yung mga nag-iinvestigate. Oo, nakakalungkot talaga yung nangyari sa kanya. Si Leo ay mabuting pulis. Ano ba ang gusto ninyong malaman?"
	  },
	  {
		"speaker": "Miguel",
		"text": "Kapitana, may mga tanong po kami tungkol kay Leo."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Wala naman. Si Leo ay maayos na pulis. Hindi siya nag-report ng kahit anong unusual. Normal lang ang lahat dito sa area namin."
	  },
	  {
		"speaker": "Miguel",
		"text": "Kapitana, pwede po ba naming makita yung patrol logbook para sa gabi na namatay si Leo?"
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Hmm... sige, pero wala kayong makikita doon. Normal lang ang lahat ng entries. Nandito lang yung logbook sa desk ko."
	  },
	  {
		"speaker": "Celine",
		"text": "Salamat po, Kapitana. Pwede po ba naming i-examine yung logbook?"
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Oo, pero sandali lang. May mga kailangan akong gawin sa taas. Babalik ako agad."
	  },
	  {
		"speaker": "Barangay NPC",
		"text": "Kapitana, may tawag po sa inyo sa second floor. May mga documents na kailangan ninyong i-check."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Ah, sige. Kayo muna dito. Babalik ako agad. Pwede ninyong tingnan yung logbook habang wala ako."
	  },
	  {
		"speaker": "Celine",
		"text": "Sige po, Kapitana. Salamat po."
	  },
	  {
		"speaker": "Miguel",
		"text": "Celine, tingnan mo yung entry ni Leo sa logbook. Parang may mali sa handwriting niya."
	  },
	  {
		"speaker": "Celine",
		"text": "Oo nga! Hindi ito yung handwriting ni Leo. Parang may nag-fake ng entry na ito."
	  },
	  {
		"speaker": "Miguel",
		"text": "Tama ka. May nag-tamper sa logbook. Baka may nag-cover up ng mga nangyari."
	  },
	  {
		"speaker": "Celine",
		"text": "Kailangan nating maghanap ng iba pang evidence. Baka may makita tayo sa first floor lang."
	  },
	  {
		"speaker": "Miguel",
		"text": "Oo, maghanap tayo ng iba pang clues dito sa first floor."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Nakita ninyo na ba yung logbook? May nakita ba kayong unusual?"
	  },
	  {
		"speaker": "Miguel",
		"text": "Kapitana, nakita namin na may mali sa patrol logbook. May nag-fake ng entry ni Leo."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Ano? Hindi totoo yan! Normal lang ang lahat ng entries sa logbook."
	  },
	  {
		"speaker": "Miguel",
		"text": "Kapitana, may nakita kaming handwriting sample ni Leo. Hindi match sa entry sa logbook."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Hindi ko alam kung ano ang sinasabi ninyo. Pero kailangan ninyong umalis na dito."
	  },
	  {
		"speaker": "Miguel",
		"text": "Kapitana, bakit po kayo defensive? May tinatago po ba kayo?"
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Wala akong tinatago! Kailangan ko lang gawin ang mga kapitana things. Umalis na kayo."
	  },
	  {
		"speaker": "Miguel",
		"text": "Sige po, Kapitana. Pero may mga tanong pa kami na kailangan namin ng sagot."
	  },
	  {
		"speaker": "Kapitana Lourdes",
		"text": "Hindi ko na kayo matutulungan. Umalis na kayo dito."
	  },
	  {
		"speaker": "Celine",
		"text": "Miguel, may nakita tayong evidence. Fake Patrol Logbook Entry at Handwriting Sample. May tinatago siya."
	  },
	  {
		"speaker": "Miguel",
		"text": "Oo, obvious na may tinatago si Kapitana. Kailangan nating mag-investigate pa sa ibang lugar."
	  }
	]
  },
  "MiguelChoices": [
	{
	  "choice_id": "initial_questions",
	  "line_index": 5,
	  "choices": [
		"May mga unusual ba na nangyari sa area ninyo?",
		"Pwede po ba naming makita yung patrol logbook?"
	  ],
	  "responses": [
		"Wala naman. Si Leo ay maayos na pulis. Hindi siya nag-report ng kahit anong unusual. Normal lang ang lahat dito sa area namin.",
		"Hmm... sige, pero wala kayong makikita doon. Normal lang ang lahat ng entries. Nandito lang yung logbook sa desk ko."
	  ]
	},
	{
	  "choice_id": "kapitana_confrontation",
	  "line_index": 19,
	  "choices": [
		"Naghahanap lang po kami ng information.",
		"Nakita namin na may mali sa patrol logbook."
	  ],
	  "responses": [
		"Hindi ninyo dapat ginagawa yan. Hindi kayo authorized na mag-snoop around dito.",
		"Ano? Hindi totoo yan! Normal lang ang lahat ng entries sa logbook."
	  ]
	},
	{
	  "choice_id": "final_response",
	  "line_index": 27,
	  "choices": [
		"Sige po, pero may mga tanong pa kami.",
		"May nakita tayong evidence."
	  ],
	  "responses": [
		"Hindi ko na kayo matutulungan. Umalis na kayo dito.",
		"Hindi ko alam kung ano ang sinasabi ninyo. Pero kailangan ninyong umalis na dito."
	  ]
	}
  ]
}
