{
  "courtroom": {
	"dialogue_lines": [
	  {
		"speaker": "Hukom",
		"text": "Ang hukuman ay nasa sesyon na. Ang kaso ng People vs. Erwin ay magsisimula na.",
		"emotion": "serious"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang akusado ay dapat tumayo para sa pagbasa ng akusasyon.",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Hukom",
		"text": "Erwin, ikaw ay inakusahan ng murder sa ilalim ng Article 248 ng Revised Penal Code. Paano mo ipinahahayag ang iyong sarili?",
		"emotion": "serious"
	  },
	  {
		"speaker": "Erwin",
		"text": "Hindi ako nagkasala, Mahal na Hukom. Inosente ako sa akusasyon na ito.",
		"action": "camera_return",
		"emotion": "determined"
	  },
	  {
		"speaker": "Hukom",
		"text": "Mabuti. Ang akusado ay nagpahayag ng hindi nagkasala. Ang prosecution ay magsisimula sa kanilang paglalahad ng kaso.",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Hukom",
		"text": "Fiscal, maaari mo nang ipresenta ang inyong opening statement.",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Salamat po, Mahal na Hukom. Patunayan ng piskalya na ang akusado na si Erwin ay nagkasala ng pagpatay sa ilalim ng Artikulo 248 ng Revised Penal Code!",
		"emotion": "confident"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Ang prosecution ay magpapakita na ang akusado ay may motibo, pagkakataon, at kakayahan na gumawa ng krimen!",
		"action": "camera_return",
		"emotion": "aggressive"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Mayroon kaming sapat na ebidensya at testimonya ng mga saksi na magpapatunay sa pagkakasala ng akusado nang walang makatuwirang pagdududa!",
		"action": "camera_return",
		"emotion": "aggressive",
		"contradictable": true,
		"press_response": "Mahal na Hukom, maaari po bang linawin kung anong mga saksi ang tinutukoy ng piskalya?",
		"follow_up": {
		  "speaker": "Fiscal",
		  "text": "Mayroon kaming mga saksi na direktang nakakita sa akusado sa lugar ng krimen. Ang kanilang testimonya ay malinaw at direktang nag-uugnay sa akusado."
		},
		"contradictions": [
		  {
			"evidence_id": "autopsy_report",
			"response": "Mahal na Hukom, tutol po! Ang autopsy report ay nagpapakita na ang sanhi ng kamatayan ay hindi tumugma sa testimonya ng mga saksi! Ang timeline ay imposible!",
			"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Magpatuloy, Abogado.",
			"success_dialogue": {
			  "speaker": "Miguel",
			  "text": "Ang autopsy report ay direktang sumasalungat sa testimonya ng mga saksi. Ito ay nagpapatunay na may inconsistencies sa kaso ng piskalya."
			},
			"erwin_dialogue": {
			  "speaker": "Erwin",
			  "text": "Mahal na Hukom, ako ay nasa ibang lugar nang naganap ang insidente. Ang autopsy report ay nagpapatunay na ang timeline ng piskalya ay mali. Hindi ko kayang pumatay ng tao, lalong-lalo na si Leo na kaibigan ko."
			},
			"celine_dialogue": {
			  "speaker": "Celine",
			  "text": "Mahal na Hukom, maaari po ba akong magsalita? Ako ay nakakita kay Erwin sa ibang lugar nang naganap ang insidente. Ang autopsy report ay nagpapatunay na ang timeline ay imposible."
			}
		  }
		]
	  },
	  {
		"speaker": "Fiscal",
		"text": "Ang prosecution ay magpapakita na ang akusado ay may confession at may mga ebidensya na nagpapatunay sa kanyang pagkakasala!",
		"action": "camera_return",
		"emotion": "confident",
		"contradictable": true,
		"press_response": "Mahal na Hukom, maaari po bang linawin kung paano nakuha ang confession na ito?",
		"follow_up": {
		  "speaker": "Fiscal",
		  "text": "Ang confession ay nakuha sa pamamagitan ng opisyal na interogasyon. Si Erwin ay kusang-loob na umamin sa kanyang krimen."
		},
		"contradictions": [
		  {
			"evidence_id": "handwriting_sample",
			"response": "Mahal na Hukom, tutol po! Ang pagsusuri ng sulat-kamay ay nagpapatunay na ang confession ay peke! Ang estilo ng sulat-kamay ay hindi tumugma sa sulat-kamay ni Erwin!",
			"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Magpatuloy, Abogado.",
			"success_dialogue": {
			  "speaker": "Fiscal",
			  "text": "Tutol po! Ang confession ay may pirma ni Erwin at opisyal na dokumento!"
			},
			"erwin_dialogue": {
			  "speaker": "Erwin",
			  "text": "Mahal na Hukom, hindi ko kailanman umamin sa krimen na ito. Ang confession na ipinakita ng piskalya ay peke. Ang pagsusuri ng sulat-kamay ay nagpapatunay na hindi ako ang sumulat nito."
			},
			"celine_dialogue": {
			  "speaker": "Celine",
			  "text": "Mahal na Hukom, kilala ko si Erwin nang matagal na. Ang kanyang sulat-kamay ay iba sa confession na ipinakita ng piskalya. Ito ay nagpapatunay na ang confession ay peke."
			}
		  }
		]
	  },
	  {
		"speaker": "Fiscal",
		"text": "Ang pag-amin na ito ay direktang nagpapakita na si Erwin ay umamin sa kanyang krimen. Mayroon din kaming pisikal na ebidensya na nag-uugnay sa kanya sa lugar ng krimen.",
		"emotion": "confident",
		"contradictable": true,
		"press_response": "Mahal na Hukom, maaari po bang linawin kung anong pisikal na ebidensya ang tinutukoy ng piskalya?",
		"follow_up": {
		  "speaker": "Fiscal",
		  "text": "Ang pisikal na ebidensya ay ang sirang body camera na natagpuan sa lugar ng krimen. Ito ay direktang nag-uugnay sa akusado."
		},
		"contradictions": [
		  {
			"evidence_id": "broken_body_cam",
			"response": "Mahal na Hukom, tutol po! Ang sirang body camera ay hindi ebidensya na si Erwin ang pumatay. Ang ebidensya ay nagpapakita na ang body camera ay nasira bago pa man ang krimen!",
			"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Magpatuloy, Abogado.",
			"success_dialogue": {
			  "speaker": "Fiscal",
			  "text": "Tutol po! Ang body camera ay ebidensya na si Erwin ay nasa lugar ng krimen!"
			},
			"erwin_dialogue": {
			  "speaker": "Erwin",
			  "text": "Mahal na Hukom, ang body camera ay nasira bago pa man ang insidente. Hindi ito maaaring gamitin laban sa akin. Ako ay nasa ibang lugar nang naganap ang krimen."
			},
			"celine_dialogue": {
			  "speaker": "Celine",
			  "text": "Mahal na Hukom, maaari po ba akong magsalita? Ang body camera ay nasira bago pa man ang insidente. Ito ay hindi maaaring gamitin bilang ebidensya laban kay Erwin."
			}
		  }
		]
	  },
	  {
		"speaker": "Fiscal",
		"text": "Ang timeline ng prosecution ay malinaw at naaayon sa lahat ng ebidensya na aming nakalap. Walang duda na si Erwin ang pumatay kay Leo.",
		"emotion": "aggressive",
		"contradictable": true,
		"press_response": "Mahal na Hukom, maaari po bang ipakita ang timeline na tinutukoy ng piskalya?",
		"follow_up": {
		  "speaker": "Fiscal",
		  "text": "Ang timeline ay nagpapakita na si Erwin ay nasa lugar ng krimen sa eksaktong oras ng pagpatay. Mayroon kaming logbook na nagpapatunay nito."
		},
		"contradictions": [
		  {
			"evidence_id": "logbook",
			"response": "Mahal na Hukom, tutol po! Ang logbook na ipinakita ng piskalya ay may mga inconsistencies! Ang timeline ay hindi tumutugma sa mga pangyayari!",
			"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Magpatuloy, Abogado.",
			"success_dialogue": {
			  "speaker": "Miguel",
			  "text": "Ang logbook ay nagpapakita na ang timeline ng piskalya ay imposible. Mayroon kaming ebidensya na sumasalungat dito."
			},
			"erwin_dialogue": {
			  "speaker": "Erwin",
			  "text": "Mahal na Hukom, ang logbook ay nagpapakita ng mga inconsistencies na nagpapatunay na ang timeline ng piskalya ay mali. Ako ay nasa ibang lugar nang naganap ang insidente."
			},
			"celine_dialogue": {
			  "speaker": "Celine",
			  "text": "Mahal na Hukom, ang logbook ay may mga pagkakasalungatan na nagpapatunay na ang timeline ay imposible. Ako ay nakakita kay Erwin sa ibang lugar."
			}
		  },
		  {
			"evidence_id": "radio_log",
			"response": "Mahal na Hukom, ang radio log ay nagpapakita na ang timeline ay hindi tumutugma! Ang komunikasyon ay naganap sa ibang oras!",
			"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Magpatuloy, Abogado.",
			"success_dialogue": {
			  "speaker": "Miguel",
			  "text": "Ang radio log ay direktang sumasalungat sa timeline ng piskalya. Ito ay nagpapatunay na ang timeline ay mali."
			},
			"erwin_dialogue": {
			  "speaker": "Erwin",
			  "text": "Mahal na Hukom, ang radio log ay nagpapakita na ang timeline ng piskalya ay mali. Ang komunikasyon ay naganap sa ibang oras, na nagpapatunay na ako ay nasa ibang lugar."
			},
			"celine_dialogue": {
			  "speaker": "Celine",
			  "text": "Mahal na Hukom, ang radio log ay nagpapakita ng mga pagkakasalungatan sa timeline. Ito ay nagpapatunay na si Erwin ay nasa ibang lugar nang naganap ang insidente."
			}
		  }
		]
	  },
	  {
		"speaker": "Hukom",
		"text": "Abogado ng depensa, maaari mo nang ipresenta ang inyong opening statement.",
		"emotion": "neutral",
		"choices": [
		  {
			"text": "Tutol po!",
			"speaker": "Miguel",
			"response": "Mahal na Hukom, tutol po! Ang timeline na ipinakita ng piskalya ay puno ng mga pagkakasalungatan at hindi tumutugma sa mga ebidensya na aming nakalap. Ang aming imbestigasyon ay nagpapakita na may malalaking butas sa kanilang timeline. Magpapakita kami ng mga dokumento at testimonya na direktang sumasalungat sa kanilang timeline at nagpapatunay na ang timeline ay imposible at hindi naaayon sa mga pangyayari. Ang ebidensya ay magpapakita na ang prosecution ay may mga inconsistencies sa kanilang ebidensya."
		  },
		  {
			"text": "Hindi ko tanggap ang pahayag ng piskalya",
			"speaker": "Miguel",
			"response": "Mahal na Hukom, hindi ko maaaring tanggapin ang mga pahayag ng piskalya. Ang aming imbestigasyon ay nagpapakita na may mga inconsistencies sa kanilang ebidensya at ang confession ay maaaring peke o nakuha sa ilalim ng presyon. Ang depensa ay magpapakita na ang prosecution ay may mga inconsistencies sa kanilang ebidensya at timeline. Magpapakita kami ng ebidensya na sumasalungat sa kaso ng piskalya at nagpapakita ng makatuwirang pagdududa. Ang akusado ay may solid alibi at ang confession ay hindi tunay."
		  }
		]
	  },
	  {
		"speaker": "Miguel",
		"text": "Mahal na Hukom, patunayan ng depensa na inosente si Erwin! Ang ebidensya ay magpapakita na siya ay napagbintangan lamang!",
		"action": "camera_return",
		"emotion": "determined"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang depensa ay magpapakita na ang prosecution ay may mga inconsistencies sa kanilang ebidensya at timeline!",
		"action": "camera_return",
		"emotion": "confident"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang timeline na ipinakita ng prosecution ay may mga malalaking butas. Hindi ito tumutugma sa mga ebidensya na aming nakalap.",
		"emotion": "confident"
	  },
	  {
		"speaker": "Miguel",
		"text": "Magpapakita kami ng ebidensya na sumasalungat sa kaso ng piskalya at nagpapakita ng makatuwirang pagdududa!",
		"action": "enable_evidence",
		"emotion": "confident"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang depensa ay magpapakita na ang akusado ay may solid alibi at ang confession ay peke!",
		"action": "camera_return",
		"emotion": "determined"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang pag-amin na ipinakita ng piskalya ay may mga pagkakasalungatan na nagpapatunay na ito ay hindi tunay. Magpapakita kami ng ebidensya na magpapatunay nito.",
		"emotion": "determined"
	  },
	  {
		"speaker": "Hukom",
		"text": "Mabuti. Abogado ng depensa, maaari mo nang ipresenta ang inyong ebidensya.",
		"action": "show_evidence_inventory",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Miguel",
		"text": "Salamat po, Mahal na Hukom. Gusto kong ipresenta ang ebidensya!",
		"emotion": "excited"
	  },
	  {
		"speaker": "Hukom",
		"text": "Anong ebidensya ang gusto mong ipresenta?",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Miguel",
		"text": "Mahal na Hukom, mayroon akong anim na ebidensya na maaaring ipresenta. Alin ang gusto ninyong makita?",
		"action": "play_evidence_bgm",
		"emotion": "confident"
	  },
	  {
		"speaker": "Hukom",
		"text": "Maaari kang pumili ng ebidensya na gusto mong ipresenta.",
		"action": "start_evidence_presentation",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Miguel",
		"text": "Mahal na Hukom, naipresenta ko na ang lahat ng ebidensya na nagpapatunay sa inosensya ni Erwin. Ang lahat ng ito ay nagpapakita ng makatuwirang pagdududa sa kaso ng piskalya.",
		"emotion": "confident"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Tutol po! Mahal na Hukom, ang ebidensya ng depensa ay hindi sapat upang patunayan ang inosensya ng akusado!",
		"action": "play_objection_bgm",
		"emotion": "angry"
	  },
	  {
		"speaker": "Miguel",
		"text": "Tutol po! Mahal na Hukom, ang ebidensya namin ay malinaw at direktang sumasalungat sa kaso ng piskalya!",
		"action": "objection_shake",
		"emotion": "defiant"
	  },
	  {
		"speaker": "Hukom",
		"text": "Sustained. Parehong panig ay may sapat na ebidensya. Magkakaroon tayo ng closing arguments.",
		"action": "show_gavel",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Hukom",
		"text": "Fiscal, maaari mo nang ipresenta ang inyong closing argument.",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Salamat po, Mahal na Hukom. Ang piskalya ay nagpapatunay na ang akusado ay nagkasala nang walang makatuwirang pagdududa!",
		"emotion": "confident"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Mayroon kaming confession, physical evidence, at testimonya ng mga saksi na direktang nag-uugnay sa akusado sa krimen.",
		"emotion": "aggressive"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Ang ebidensya ng depensa ay hindi sapat upang patunayan ang inosensya ng akusado. Ang prosecution ay nagpapatunay ng kaso namin.",
		"emotion": "confident"
	  },
	  {
		"speaker": "Hukom",
		"text": "Abogado ng depensa, maaari mo nang ipresenta ang inyong closing argument.",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Miguel",
		"text": "Salamat po, Mahal na Hukom. Ang depensa ay nagpapatunay na ang akusado ay inosente at ang piskalya ay hindi nakapagpatunay ng kaso!",
		"emotion": "determined"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang ebidensya na aming ipinresenta ay nagpapakita ng malinaw na inconsistencies sa kaso ng prosecution. Ang confession ay peke, ang timeline ay mali, at ang alibi ni Erwin ay totoo.",
		"emotion": "confident"
	  },
	  {
		"speaker": "Miguel",
		"text": "Ang piskalya ay hindi nakapagpatunay ng kaso nila nang walang makatuwirang pagdududa. Kaya naman, si Erwin ay dapat na mapalaya.",
		"emotion": "determined"
	  },
	  {
		"speaker": "Erwin",
		"text": "Mahal na Hukom, ako ay inosente. Hindi ko kayang pumatay ng tao, lalong-lalo na si Leo na kaibigan ko. Nasa ibang lugar ako nang naganap ang insidente.",
		"emotion": "determined"
	  },
	  {
		"speaker": "Celine",
		"text": "Mahal na Hukom, maaari po ba akong magsalita? Mayroon akong sasabihin tungkol sa kaso.",
		"emotion": "nervous"
	  },
	  {
		"speaker": "Hukom",
		"text": "Maaari, Celine. Ano ang gusto mong sabihin?",
		"emotion": "neutral"
	  },
	  {
		"speaker": "Celine",
		"text": "Mahal na Hukom, ang ebidensya ay nagpapakita na si Erwin ay inosente. Mayroon akong impormasyon na maaaring makatulong sa kaso.",
		"emotion": "determined"
	  },
	  {
		"speaker": "Fiscal",
		"text": "Tutol po! Ang testimonya ni Celine ay hindi maaaring tanggapin dahil siya ay may personal na relasyon sa akusado!",
		"action": "play_objection_bgm",
		"emotion": "angry"
	  },
	  {
		"speaker": "Miguel",
		"text": "Tutol po! Mahal na Hukom, ang testimonya ni Celine ay nagbibigay ng mahalagang impormasyon tungkol sa kaso!",
		"action": "objection_shake",
		"emotion": "defiant"
	  },
	  {
		"speaker": "Hukom",
		"text": "Sustained. Magpatuloy, Celine.",
		"action": "show_gavel",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Celine",
		"text": "Salamat po, Mahal na Hukom. Ang ebidensya ay nagpapakita na si Erwin ay nasa ibang lugar nang naganap ang insidente. Mayroon akong impormasyon na nagpapatunay nito.",
		"emotion": "confident"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang hukuman ay kailangan ng oras upang pag-aralan ang lahat ng ebidensya. Magkakaroon tayo ng deliberation.",
		"action": "camera_return",
		"emotion": "serious"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang hukuman ay magdedeliberate na. Ang kaso ay tapos na at ang hatol ay ibibigay ngayon.",
		"action": "camera_return",
		"emotion": "serious"
	  },
	  {
		"speaker": "Hukom",
		"text": "Matapos ang masusing pag-aaral ng lahat ng ebidensya, ang hukuman ay nagpapatunay na...",
		"action": "play_verdict_bgm",
		"emotion": "serious"
	  },
	  {
		"speaker": "Hukom",
		"text": "Si Erwin ay INOSENTE!",
		"action": "dramatic_shake",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang lahat ng ebidensya ay nagpapatunay na si Erwin ay hindi nagkasala!",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang confession ay peke, ang alibi ay totoo, at ang prosecution ay may mga inconsistencies!",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Hukom",
		"text": "Si Erwin ay MALAYA na!",
		"action": "dramatic_shake",
		"emotion": "authoritative"
	  },
	  {
		"speaker": "Miguel",
		"text": "SALAMAT PO, MAHAL NA HUKOM! Ang katotohanan ay nanalo!",
		"action": "play_victory_bgm",
		"emotion": "triumphant"
	  },
	  {
		"speaker": "Erwin",
		"text": "Salamat po, Mahal na Hukom! Salamat sa inyo, Miguel!",
		"emotion": "emotional"
	  },
	  {
		"speaker": "Hukom",
		"text": "Ang kaso ay tapos na. Ang hukuman ay adjourned.",
		"action": "camera_return",
		"emotion": "serious"
	  }
	],
	"evidence_testimony": [
	  {
		"evidence_id": "broken_body_cam",
		"testimony": "TUTOL PO! Ang footage ng body camera ay nagpapakita na wala si Erwin sa lugar ng krimen sa panahon ng insidente!",
		"significance": "Ang ebidensyang ito ay direktang sumasalungat sa timeline ng prosecution! Ang body camera ay naglalaman ng mahalagang impormasyon na nagpapatunay na si Erwin ay hindi nasa lugar ng krimen sa oras na naganap ang insidente!",
		"objection": "Tutol po! Ang ebidensyang ito ay hindi maaaring tanggapin dahil nasira ito!",
		"objection_follow_up": "Mahal na Hukom, ang body camera ay nasira at hindi maaaring maging maaasahang pinagmulan ng impormasyon! Ang depensa ay nagpapakita ng kawalan ng paghahanda sa pagpresenta ng ebidensya na may sira!",
		"objection_additional": "Ang ebidensyang ito ay walang probative value dahil ang kundisyon nito ay hindi maaasahan! Hindi maaaring gamitin ang nasirang ebidensya laban sa prosecution!",
		"counter_objection": "Tutol po! Mahal na Hukom, kahit na nasira ang body camera, ang footage na nakuha bago ito nasira ay nagpapakita ng malinaw na ebidensya!",
		"counter_additional": "Ang ebidensyang ito ay may mahalagang impormasyon na maaaring makatulong sa kaso! Ayon sa Rules of Court, Rule 130, Section 24, ang ebidensya ay maaaring tanggapin kahit na may sira kung ang impormasyon ay maaaring makuha!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang footage na nakuha bago ang pagkasira ay may probative value. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang body camera footage ay nagpapakita ng malinaw na ebidensya na si Erwin ay hindi nasa lugar ng krimen! Ang ebidensyang ito ay nagpapatunay na ang piskalya ay may maling timeline at ang akusado ay inosente!"
	  },
	  {
		"evidence_id": "logbook",
		"testimony": "TUTOL PO! Ang police logbook ay nagpapakita ng mga pagkakasalungatan sa opisyal na ulat, na nagmumungkahi ng pagbabago ng ebidensya!",
		"significance": "Ito ay nagtataas ng mga tanong tungkol sa integridad ng imbestigasyon! Ang logbook ay nagpapakita ng mga discrepancies na nagpapatunay na may mga problema sa opisyal na ulat!",
		"objection": "Tutol po! Ang logbook ay opisyal na dokumento ng pulisya!",
		"objection_follow_up": "Mahal na Hukom, hindi maaaring tanggapin ang mga pagkakasalungatan na ito dahil ito ay opisyal na rekord! Ang depensa ay nagpapakita ng kawalan ng respeto sa opisyal na dokumento ng pulisya!",
		"objection_additional": "Ayon sa Rules of Court, Rule 130, Section 49, ang opisyal na rekord ay may presumption ng regularity! Hindi maaaring gamitin ang mga pagkakasalungatan laban sa prosecution dahil ito ay opisyal na dokumento!",
		"counter_objection": "Tutol po! Mahal na Hukom, ang mga pagkakasalungatan ay nagpapakita ng posibleng pagbabago ng ebidensya!",
		"counter_additional": "Ang mga pagkakaiba na ito ay direktang nagpapakita na may problema sa imbestigasyon! Ayon sa Rules of Court, Rule 130, Section 24, ang ebidensya ng pagbabago ay maaaring tanggapin upang magpakita ng inconsistencies sa kaso ng prosecution!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang mga pagkakasalungatan ay maaaring gamitin upang magpakita ng inconsistencies. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang police logbook ay nagpapakita ng malinaw na pagkakasalungatan na nagpapatunay na may pagbabago ng ebidensya! Ang ebidensyang ito ay nagpapatunay na ang imbestigasyon ay may mga problema at hindi maaaring pagkatiwalaan!"
	  },
	  {
		"evidence_id": "handwriting_sample",
		"testimony": "TUTOL PO! Ang pagsusuri ng sulat-kamay ay nagpapatunay na ang pag-amin ay peke at hindi sinulat ni Erwin!",
		"significance": "Ang ebidensyang ito ay nagpapahina sa pangunahing ebidensya ng prosecution!",
		"objection": "Tutol po! Ang pag-amin ay may pirma ni Erwin!",
		"objection_follow_up": "Mahal na Hukom, hindi maaaring tanggapin ang pagsusuri ng sulat-kamay dahil mayroong pirma ang pag-amin! Ang depensa ay nagpapakita ng kawalan ng respeto sa opisyal na dokumento na may pirma!",
		"objection_additional": "Ayon sa Rules of Court, Rule 130, Section 49, ang dokumento na may pirma ay may presumption ng authenticity! Hindi maaaring gamitin ang pagsusuri ng sulat-kamay laban sa opisyal na dokumento na may pirma!",
		"counter_objection": "Tutol po! Mahal na Hukom, ang pagsusuri ng sulat-kamay ay nagpapatunay na peke ang pag-amin!",
		"counter_additional": "Ang pagkakaiba sa estilo ng sulat-kamay ay malinaw na nagpapakita na hindi ito sinulat ni Erwin! Ayon sa Rules of Court, Rule 130, Section 24, ang expert testimony tungkol sa sulat-kamay ay maaaring tanggapin upang magpakita ng forgery!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang expert testimony tungkol sa sulat-kamay ay may probative value. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang pagsusuri ng sulat-kamay ay nagpapatunay na peke ang pag-amin! Ang ebidensyang ito ay nagpapatunay na ang prosecution ay may maling ebidensya!"
	  },
	  {
		"evidence_id": "radio_log",
		"testimony": "TUTOL PO! Ang komunikasyon sa radyo ay nagpapakita na ang mga responding officers ay hindi sumusunod sa tamang pamamaraan!",
		"significance": "Ito ay nagmumungkahi ng misconduct sa proseso ng imbestigasyon!",
		"objection": "Tutol po! Ang mga officers ay sumusunod sa protocol!",
		"objection_follow_up": "Mahal na Hukom, ang radio log ay hindi maaaring gamitin laban sa piskalya dahil ito ay opisyal na rekord! Ang depensa ay nagpapakita ng kawalan ng respeto sa opisyal na komunikasyon ng pulisya!",
		"objection_additional": "Ayon sa Rules of Court, Rule 130, Section 49, ang opisyal na rekord ng komunikasyon ay may presumption ng regularity! Hindi maaaring gamitin ang radio log laban sa prosecution dahil ito ay opisyal na dokumento ng pulisya!",
		"counter_objection": "Tutol po! Mahal na Hukom, ang radio log ay nagpapakita ng mga paglabag sa pamamaraan!",
		"counter_additional": "Ang mga paglabag na ito ay direktang nagpapakita ng maling pag-uugali sa imbestigasyon! Ayon sa Rules of Court, Rule 130, Section 24, ang ebidensya ng paglabag sa protocol ay maaaring tanggapin upang magpakita ng misconduct!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang radio log ay maaaring gamitin upang magpakita ng inconsistencies sa protocol. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang radio log ay nagpapakita ng malinaw na paglabag sa protocol! Ang ebidensyang ito ay nagpapatunay na ang imbestigasyon ay may mga problema!"
	  },
	  {
		"evidence_id": "autopsy_report",
		"testimony": "TUTOL PO! Ang ulat ng autopsy ay nagpapakita na ang sanhi ng kamatayan ay hindi tumugma sa teorya ng piskalya!",
		"significance": "Ang ebidensyang ito ay nagbibigay ng alternatibong paliwanag para sa kamatayan ng biktima!",
		"objection": "Tutol po! Ang ulat ng autopsy ay sumusuporta sa piskalya!",
		"objection_follow_up": "Mahal na Hukom, ang mga natuklasan ay direktang nag-uugnay sa akusado sa krimen! Ang depensa ay nagpapakita ng kawalan ng pag-unawa sa medical evidence!",
		"objection_additional": "Ayon sa Rules of Court, Rule 130, Section 49, ang medical report ay may presumption ng accuracy! Hindi maaaring gamitin ang autopsy report laban sa prosecution dahil ito ay sumusuporta sa kaso ng piskalya!",
		"counter_objection": "Tutol po! Mahal na Hukom, ang ulat ng autopsy ay nagpapakita ng mga pagkakasalungatan sa teorya ng piskalya!",
		"counter_additional": "Ang sanhi ng kamatayan ay hindi tumutugma sa timeline at teorya ng piskalya! Ayon sa Rules of Court, Rule 130, Section 24, ang medical expert testimony ay maaaring tanggapin upang magpakita ng inconsistencies sa timeline!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang medical expert testimony ay may probative value at maaaring gamitin upang magpakita ng inconsistencies. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang ulat ng autopsy ay nagpapakita ng malinaw na pagkakasalungatan sa timeline ng piskalya! Ang ebidensyang ito ay nagpapatunay na ang prosecution ay may maling teorya!"
	  },
	  {
		"evidence_id": "leos_notebook",
		"testimony": "TUTOL PO! Ang personal na notebook ni Erwin ay naglalaman ng kanyang alibi at nagpapatunay na siya ay nasa ibang lugar sa panahon ng insidente!",
		"significance": "Ito ay nagbibigay ng matibay na alibi para sa akusado!",
		"objection": "Tutol po! Ang notebook ay maaaring ginawa lamang para sa alibi!",
		"objection_follow_up": "Mahal na Hukom, hindi maaaring tanggapin ang notebook bilang ebidensya dahil maaari itong peke! Ang depensa ay nagpapakita ng kawalan ng paghahanda sa pagpresenta ng tunay na ebidensya!",
		"objection_additional": "Ayon sa Rules of Court, Rule 130, Section 24, ang personal na dokumento ay maaaring peke at walang probative value! Hindi maaaring gamitin ang notebook laban sa prosecution dahil maaari itong fabricated para sa alibi!",
		"counter_objection": "Tutol po! Mahal na Hukom, ang notebook ay naglalaman ng detalyadong impormasyon na nagpapatunay sa alibi!",
		"counter_additional": "Ang mga detalye dito ay hindi maaaring gawin lamang para sa alibi - ito ay tunay na rekord! Ayon sa Rules of Court, Rule 130, Section 24, ang personal na rekord na may detalyadong impormasyon ay maaaring tanggapin bilang ebidensya ng alibi!",
		"judge_response": "Tinatanggap. Ang ebidensya ay maaaring tanggapin. Ang detalyadong impormasyon sa notebook ay may probative value bilang ebidensya ng alibi. Magpatuloy, Abogado.",
		"damning_evidence": "Mahal na Hukom, ang notebook ay nagpapakita ng malinaw na alibi na si Erwin ay nasa ibang lugar! Ang ebidensyang ito ay nagpapatunay na ang akusado ay inosente!"
	  }
	],
	"character_testimonies": [],
	"story_flow": {
	  "intro": "Ang courtroom scene ay nagsisimula sa pagtawag ng hukom sa sesyon.",
	  "prosecution": "Ang fiscal ay nagpresenta ng kanilang kaso laban kay Erwin.",
	  "defense": "Si Miguel ay nagpresenta ng depensa kasama ang ebidensya at testimonya.",
	  "evidence_presentation": "Ang bawat ebidensya ay ipinresenta kasama ang pagpapaliwanag ng kahalagahan nito.",
	  "testimony": "Ang testimonya ng saksi ay ibinibigay para suportahan ang kaso ng depensa.",
	  "closing": "Ang depensa ay nagpapahinga at ang hukuman ay naghahanda para sa deliberation."
	},
	"branching_dialogues": {
	  "wrong_evidence_2_lives": {
		"judge": "Abogado, ang ebidensyang ito ay walang kaugnayan sa kaso. Mag-ingat ka sa susunod na pagpresenta.",
		"prosecutor": "Objection! Ang ebidensyang ito ay hindi maaaring tanggapin dahil walang kaugnayan sa kaso!",
		"miguel": "Patawad po, Your Honor. Magpapakita ako ng mas angkop na ebidensya."
	  },
	  "wrong_evidence_1_life": {
		"judge": "Abogado, ito na ang huling babala. Ang ebidensyang ito ay hindi naaangkop sa kaso.",
		"prosecutor": "Objection! Ang depensa ay nagpapakita ng kawalan ng paghahanda!",
		"miguel": "Your Honor, humihingi ako ng paumanhin. Magiging mas maingat ako sa susunod."
	  },
	  "game_over": {
		"judge": "Abogado, ikaw ay napatunayang hindi handa. Ang kaso ay magpapatuloy nang walang karagdagang ebidensya mula sa depensa.",
		"prosecutor": "Your Honor, ang depensa ay nagpapakita ng kawalan ng paghahanda at hindi karapat-dapat sa karagdagang pagkakataon.",
		"miguel": "Your Honor, humihingi ako ng paumanhin. Nais kong magpatuloy sa kaso."
	  },
	  "limited_evidence_continuation": {
		"miguel": "Your Honor, kahit na may limitasyon, patuloy kong ipinaglalaban ang inosensya ni Erwin.",
		"judge": "Mabuti. Magpatuloy sa inyong depensa.",
		"fiscal": "Your Honor, ang depensa ay nagpapakita ng kawalan ng paghahanda."
	  }
	},
	"evidence_correctness": {
	  "opening_statements_phase": {
		"correct": ["broken_body_cam", "logbook"],
		"wrong": ["handwriting_sample", "radio_log", "autopsy_report", "leos_notebook"]
	  },
	  "prosecution_case_phase": {
		"correct": ["handwriting_sample", "radio_log"],
		"wrong": ["broken_body_cam", "logbook", "autopsy_report", "leos_notebook"]
	  },
	  "defense_case_phase": {
		"correct": ["autopsy_report", "leos_notebook"],
		"wrong": ["broken_body_cam", "logbook", "handwriting_sample", "radio_log"]
	  },
	  "cross_examination_phase": {
		"correct": ["broken_body_cam", "handwriting_sample"],
		"wrong": ["logbook", "radio_log", "autopsy_report", "leos_notebook"]
	  },
	  "closing_arguments_phase": {
		"correct": ["leos_notebook", "autopsy_report"],
		"wrong": ["broken_body_cam", "logbook", "handwriting_sample", "radio_log"]
	  }
	},
	"legal_procedures": {
	  "arraignment": "Ang akusado ay binabasa ng akusasyon at nagpahayag ng hindi nagkasala",
	  "opening_statements": "Ang prosecution at depensa ay naglalahad ng kanilang mga argumento",
	  "prosecution_case": "Ang prosecution ay naglalahad ng kanilang ebidensya at saksi",
	  "defense_case": "Ang depensa ay naglalahad ng kanilang ebidensya at saksi",
	  "cross_examination": "Ang prosecution ay nag-cross-examine sa mga saksi ng depensa",
	  "closing_arguments": "Ang prosecution at depensa ay naglalahad ng kanilang final arguments",
	  "deliberation": "Ang hukuman ay magdedeliberate at magbibigay ng hatol"
	}
  }
}
