{
  "head_police_cutscene": {
	"dialogue_lines": [
	  {
		"speaker": "Police",
		"text": "Sir, may report po kami tungkol sa drug bust operation sa Barangay San Jose."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Ah oo, yung operation natin kahapon. Maganda ang resulta. May nahuli tayong 3 suspects."
	  },
	  {
		"speaker": "Police",
		"text": "Opo sir, pero may mga inconsistencies sa report. Baka kailangan nating i-review yung radio logs."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Sige, i-review natin yung radio logs para sa proper documentation. Dapat accurate ang lahat ng reports."
	  },
	  {
		"speaker": "Miguel",
		"text": "Good morning po, Sir PO1 Darwin. May mga tanong po kami tungkol kay Leo Mendoza."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Ah, kayo pala yung mga nag-iinvestigate. Si Leo ay mabuting pulis. May proper authorization ba kayo?"
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Pwede mo bang i-continue yung report mo sa ibang lugar? May visitors ako."
	  },
	  {
		"speaker": "Police",
		"text": "Opo sir, sige po. I-continue ko na lang sa desk ko."
	  },
	  {
		"speaker": "Celine",
		"text": "Pwede po ba naming makita yung radio communication logs? Baka may makita kami doon na related sa nangyari kay Leo."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Radio logs? Bakit ninyo kailangan yun? Hindi kayo authorized na mag-access ng police records."
	  },
	  {
		"speaker": "Miguel",
		"text": "Para sa defense ng aming client po."
	  },
	  {
		"speaker": "Miguel",
		"text": "Under Section 1, Rule 115 ng Rules of Court, may karapatan kaming mag-investigate at mag-access ng evidence para sa legal case."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Hindi ninyo pwedeng gawin yan nang walang proper authorization. Kailangan ninyong mag-request sa higher authorities."
	  },
	  {
		"speaker": "Celine",
		"text": "Sir, under Article III, Section 7 ng 1987 Constitution at Republic Act No. 6713, may karapatan kaming mag-access ng public records para sa legal proceedings."
	  },
	  {
		"speaker": "Celine",
		"text": "Ito ay part ng due process."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Sige, pero wala kayong makikita doon."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Normal lang ang lahat ng radio communications namin. Eto yung logs."
	  },
	  {
		"speaker": "Miguel",
		"text": "Salamat po, Sir. Titingnan lang namin para sa legal documentation."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Lahat ng entries ay proper at documented. Si Leo ay mabuting pulis."
	  },
	  {
		"speaker": "Celine",
		"text": "Salamat po, Sir. Para lang sa legal requirements namin."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Sige, pero remember - hindi kayo pwedeng mag-copy o mag-take ng photos."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "Viewing lang."
	  },
	  {
		"speaker": "Miguel",
		"text": "Opo, Sir. Viewing lang po. Salamat sa cooperation."
	  },
	  {
		"speaker": "Miguel",
		"text": "\"Ayos. Nakuha namin yung radio logs.\""
	  },
	  {
		"speaker": "Celine",
		"text": "Miguel, may nakita tayong evidence."
	  },
	  {
		"speaker": "Celine",
		"text": "Radio Communication Log at may gaps sa communication. May tinatago siya."
	  },
	  {
		"speaker": "PO1 Darwin",
		"text": "\"Wala naman silang makikita doon. Normal lang ang lahat ng entries. Hindi nila alam na may mga missing entries.\""
	  },
	  {
		"speaker": "Miguel",
		"text": "Oo, obvious na may tinatago si PO1 Darwin."
	  },
	  {
		"speaker": "Miguel",
		"text": "Pero hindi natin pwedeng i-confront siya dito. Kailangan nating mag-gather ng more evidence."
	  },
	  {
		"speaker": "Celine",
		"text": "Tama. Under Rule 130 ng Rules of Court, kailangan nating i-establish yung chain of custody ng evidence. Kailangan nating i-preserve yung integrity ng lahat ng evidence."
	  },
	  {
		"speaker": "Celine",
		"text": "Siguro pwede tayong mag-check sa morgue para sa autopsy report. Under Republic Act No. 6713, may karapatan tayong mag-access ng public records para sa legal proceedings."
	  }
	]
  }
}
